[{"title": "Secure Portfolio Site", "description": "Secure full-stack portfolio platform built with Flask. Features user authentication, role-based access, category-filtered project showcases, integrated cybersecurity tools, and admin-managed content. Includes security logging and is deployed with Render.", "image_url": "", "external_link": "https://github.com/JayStalt/secure-portfolio-site", "category": "cyber"}, {"title": "Cloud Security Report", "description": "A collaborative research project focused on evaluating and testing cloud infrastructure security using AWS and GCP. Our team performed penetration testing techniques including ARP spoofing and NMAP vulnerability scans to explore real-world vulnerabilities and assess built-in cloud protections.", "image_url": "", "external_link": "https://github.com/JayStalt/cloud-security-report", "category": "cyber"}, {"title": "DHCP Client Server System", "description": "This project is a simulation of a basic DHCP (Dynamic Host Configuration Protocol) system, built using Python and UDP socket programming.", "image_url": "", "external_link": "https://github.com/JayStalt/DHCP-Client-Server-System", "category": "cyber"}, {"title": "Secure Portfolio Site", "description": "Secure full-stack portfolio platform built with Flask. Features user authentication, role-based access, category-filtered project showcases, integrated cybersecurity tools, and admin-managed content. Includes security logging and is deployed with Render.", "image_url": "", "external_link": "https://github.com/JayStalt/secure-portfolio-site", "category": "fullstack"}, {"title": "Touge Heats App", "description": "A real-time tracking and performance analysis app for driving enthusiasts, inspired by motorsport culture.", "image_url": "", "external_link": "https://github.com/JayStalt/TougeHeatsApp", "category": "fullstack"}, {"title": "Thrift a Ticket", "description": "A software that will find the lowest ticket price for a particular Artist", "image_url": "", "external_link": "https://github.com/JayStalt/Thrift-a-Ticket", "category": "fullstack"}, {"title": "Check List App", "description": "A Windows desktop checklist application built with WinForms and SQLite. Users can track daily tasks, mark them as completed, earn stars for completed tasks, and edit or delete tasks as needed. Includes a preloaded weekly task list and a star tracking system.", "image_url": "", "external_link": "https://github.com/JayStalt/ChecklistApp", "category": "fullstack"}, {"title": "Time Attack", "description": "high-speed racing game developed using Unreal Engine 5.", "image_url": "", "external_link": "https://github.com/JayStalt/RacingGame", "category": "games"}, {"title": "Choose Your Own Adventure Game", "description": "For this project, I developed an interactive choose-your-own-adventure game using a custom game engine built with HTML5 and Web Canvas. The game immerses players in a fantasy narrative where they choose a quest and navigate through a series of choices that shape their journey. Featuring dynamic loading screens with animated GIFs, the game provides a visually engaging experience as players progress through the story. The narrative branches into over 8 different custom endings, offering a variety of unique story paths and outcomes based on the player's decisions. Custom animations and graphics enhance the visual appeal and interactivity of the game, showcasing my skills in game design, storytelling, and technical implementation within a web-based environment.", "image_url": "", "external_link": "https://github.com/JayStalt/Choose-Your-Own-Adventure-Game", "category": "games"}, {"title": "2.5D Adventure Game", "description": "Developed a 2.5D game that immerses players in a virtual exploration of Tokyo, Japan, based on my real-life travel experience. Utilizing pre-loaded images from Google Maps Street View, players can traverse forward, backward, left, and right through the streets of Tokyo. I built a custom game engine using HTML5 and Web Canvas, enabling smooth navigation and interactive gameplay. This project showcases my ability to integrate real-world data with custom game development, providing an authentic and engaging user experience.", "image_url": "", "external_link": "https://github.com/JayStalt/2.5-D-Adventure-Game", "category": "games"}, {"title": "Boiding Game", "description": "This is a 2D simulation game implemented using HTML5 Canvas and JavaScript, featuring flocking behavior based on Craig Reynolds' Boids algorithm. In this game, you play as sharks that are attempting to eat more jellyfish than the other player. Players will use either wasd or the arrow keys to move their shark. There are 5 stages, you begin on the center stage, there is one stage for each direction. You can only navigate to these stages once you have captured all jellyfish on the current stage. Navigate to the desired stage by hitting the border with a character.", "image_url": "", "external_link": "https://github.com/JayStalt/BoidsGame", "category": "games"}, {"title": "Better Roars", "description": "An addon for World of Warcraft that replaces the in game bear form sounds for a more realistic sounding experience.", "image_url": "", "external_link": "https://github.com/JayStalt/Better-Roars", "category": "games"}, {"title": "Ability Timer", "description": "A dynamic timer for World of Warcraft ability Breath of Sindragosa above your character's head involves using WoW's API to track the ability's duration and runic power.", "image_url": "", "external_link": "https://github.com/JayStalt/BoS_Timer", "category": "games"}, {"title": "Translator Addon", "description": "The WoW Translation Add-On is designed to break down language barriers in World of Warcraft, enabling players from different linguistic backgrounds to communicate seamlessly. Whether you're coordinating raids with non-English speakers or bridging cultural gaps during in-game events, this add-on fosters collaboration and inclusivity.", "image_url": "", "external_link": "https://github.com/JayStalt/MyTranslator", "category": "games"}, {"title": "“You’re Buyin!” - Narrative Perspective Exercise", "description": "“You’re Buyin!” is a humorous slice-of-life vignette that explores the timeless roommate dilemma: who’s paying for the pizza? Set in a stifling hot living room, the story unfolds through three versions — third person, first person past tense, and first person present tense — capturing the same comically mundane moment from different narrative perspectives. ", "image_url": "", "external_link": "https://docs.google.com/document/d/1XRWK3EoKmGiyp2bhrWqDxTq5_9RLJdJ65m267G1OSiY/edit?usp=sharing", "category": "writing"}, {"title": "“The Night Before the End” - Short Story", "description": "“The Night Before the End” is a character-driven short scene set on the eve of an unknown but seemingly doomed fate. With death looming, a ragtag group of adventurers—each with wildly different personalities—tries to lighten the mood by sharing stories around a fire. Told entirely through dialogue, the story captures a balance of dark humor, interpersonal tension, and emotional depth. ", "image_url": "", "external_link": "https://docs.google.com/document/d/1p2jNG1Wpp8KmosGS5JIAjiE6YL7iji0AryPR2V3X3S4/edit?usp=sharing", "category": "writing"}, {"title": "'The Long Watch\" - Poetic Trio", "description": "This poetic trio explores the tension, solitude, and grim humor of standing watch. Through a haiku, a fixed form poem, and a limerick. ", "image_url": "", "external_link": "https://docs.google.com/document/d/1skTagdvH416uSWE86r3XJEvqO9EClSVaCpcX2prILYo/edit?usp=sharing", "category": "writing"}, {"title": "'Reunion\" - Short Story", "description": "“Reunion” is a gritty sci-fi western that blends cybernetic dystopia with old-school saloon drama. Years after vanishing into self-imposed exile, the reclusive bioengineer known only as Doc is dragged back into the fold by his old comrade, Kylde Kalvin. ", "image_url": "", "external_link": "https://docs.google.com/document/d/1wG32qaD8iiRLlPT1-EKB7R2IGp4Ce89fsfQ-TQ2qaY8/edit?usp=sharing", "category": "writing"}]